---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.AnalyticalMember
source: html/67d7cab9-7549-2a32-7f40-28172e56885f.htm
---
# AnalyticalMember Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.